#018

data ="""75
95 64
17 47 82
18 35 87 10
20 04 82 47 65
19 01 23 75 03 34
88 02 77 73 07 63 67
99 65 04 28 06 16 70 92
41 41 26 56 83 40 80 70 33
41 48 72 33 47 32 37 16 94 29
53 71 44 65 25 43 91 52 97 51 14
70 11 33 28 77 73 17 78 39 68 17 57
91 71 52 38 17 14 91 43 58 50 27 29 48
63 66 04 68 89 53 67 30 73 16 69 87 40 31
04 62 98 27 23 09 70 98 73 93 38 53 60 04 23"""

def solution(n):
    #삼각형 -> 리스트
    n = n.split('\n')
    for i in range(len(n)):
       n[i] = n[i].split()
    print(n) 

    # 아래서부터 위로 올라가기
    for i in range(1,len(n)):
        for j in range(len(n[len(n)-i-1])):
            if n[len(n)-i][j] > n[len(n)-i][j+1]:
                n[len(n)-i-1][j] = int(n[len(n)-i-1][j]) +int(n[len(n)-i][j] )
            else:
                n[len(n)-i-1][j] = int(n[len(n)-i-1][j]) + int(n[len(n)-i][j+1] )

    return n[0][0]
    
solution(data)

#--------------------------------------------------
#answer 1074
